In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
ttn_df=pd.read_excel("titanic3.xls")

In [3]:
ttn_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
ttn_df.shape

(1309, 14)

In [5]:
ttn_df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [6]:
ttn_df.drop(columns=["cabin","boat","body"],inplace=True)

In [7]:
ttn_df["fare"].fillna(ttn_df["fare"].mean(),inplace=True)

In [8]:
ttn_df["embarked"].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [9]:
ttn_df.drop(columns="embarked",inplace=True)

In [10]:
ttn_df.drop(columns="home.dest",inplace=True)

In [11]:
ttn_df["age"].fillna(ttn_df["age"].mean(),inplace=True)

In [12]:
ttn_df.drop(columns="ticket",inplace=True)

In [13]:
ttn_df["family"]=ttn_df["sibsp"]+ttn_df["parch"]
ttn_df

,pclass,survived,name,sex,age,sibsp,parch,fare,family
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,211.3375,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,151.5500,3
2,1,0,"Allison, Miss. Helen Loraine",female,2.000000,1,2,151.5500,3
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,151.5500,3
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,151.5500,3
...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.500000,1,0,14.4542,1
1305,3,0,"Zabour, Miss. Thamine",female,29.881135,1,0,14.4542,1
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,7.2250,0
1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,7.2250,0
1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,7.8750,0

In [14]:
ttn_df.isnull().sum()

pclass      0
survived    0
name        0
sex         0
age         0
sibsp       0
parch       0
fare        0
family      0
dtype: int64

In [15]:
def bin_con(s):
    if s.lower() == "female":
        return 0
    elif s.lower() == "male":
        return 1

In [16]:
ttn_df["sex"]=ttn_df["sex"].apply(lambda s: bin_con(s))

In [17]:
cat_df=ttn_df[["survived","pclass","sex"]]
num_df=ttn_df[["age","family","fare","survived"]]

In [18]:
cat_df[["pclass","survived"]].groupby(["pclass"]).mean()

        survived
pclass
1       0.619195
2       0.429603
3       0.255289

In [19]:
cat_df[["sex","survived"]].groupby(["sex"]).mean()

     survived
sex
0    0.727468
1    0.190985

In [20]:
num_df[["family","survived"]].groupby(["family"]).mean().sort_values(by="family",ascending=False)

        survived
family
10      0.000000
7       0.000000
6       0.250000
5       0.200000
4       0.272727
3       0.697674
2       0.566038
1       0.536170
0       0.302532